#_*_coding:utf-8
#引用：
a = 100
b = a
print("a的id:",id(a),",a的值",a)
print("b的id:",id(b),",b的值",b)
a = 200
print("a的id:",id(a),",a的值",a)
print("b的id:",id(b),",b的值",b)

#######################################
# a的id: 1826214672 ,a的值 100
# b的id: 1826214672 ,b的值 100
# a的id: 1826217872 ,a的值 200
# b的id: 1826214672 ,b的值 100

a = [11,22,33]
b = a
print("a的id:",id(a),",a的值",a)
print("b的id:",id(b),",b的值",b)
a.append(44)
print("a的id:",id(a),",a的值",a)
print("b的id:",id(b),",b的值",b)

###################################
# a的id: 40827336 ,a的值 [11, 22, 33]
# b的id: 40827336 ,b的值 [11, 22, 33]
# a的id: 40827336 ,a的值 [11, 22, 33, 44]
# b的id: 40827336 ,b的值 [11, 22, 33, 44]